<template>
  <div class="list-page">
    <div class="list-content">
      <mt-index-list>
        <template v-for="(item,i) in cityList">
          <mt-index-section :index="item.name">
            <template v-for="(city,j) in item.cityName">
              <mt-cell :title="city" @click.native="selectItem(city)"></mt-cell>
            </template>
          </mt-index-section>
        </template>
      </mt-index-list>
    </div>
  </div>
</template>

<script>
    import {mapMutations} from 'vuex'
    import { AMapManager } from 'vue-amap'
    export default {
      name: "s-list",
      data(){
          return{
            cityList : [
              {
              name: '♥',
              cityName: ['上海', '北京', '广州', '南京', '杭州', '深圳', '厦门']
              },
              {
                name: 'A',
                cityName: ['安溪', '宿松县(安庆)', '安阳', '安顺', '安康', '安宁', '安陆', '鞍山', '文峰区(安阳)', '桐城市(安庆)', '安庆', '滑县(安阳)']
              },
              {
                name: 'B',
                cityName: ['无棣县(滨州)', '怀远县(蚌埠)', '保山', '北海', '蚌埠', '北京', '利辛县(亳州)', '保定', '定兴县(保定)', '泊头', '容城县(保定)', '隆阳区(保山)', '海城区(北海)', '百色', '本溪',
                  '亳州', '高碑店市(保定)', '安国市(保定)', '滨州', '邹平县(滨州)', '白山', '宝鸡', '高阳县(保定)', '蒙城县(亳州)', '白城', '包头', '腾冲市(保山)', '白银', '惠民县(滨州)', '巴彦淖尔'
                ]
              },
              {
                name: 'C',
                cityName: ['北票市(朝阳)', '东光县(沧州)', '成都', '邛崃市(成都)', '朝阳', '都江堰(成都)', '赤壁', '明光市(滁州)', '望城区(长沙)', '浏阳市(长沙)', '长治', '澄迈县', '常熟', '桂阳县(郴州)',
                  '巢湖', '定远县(滁州)', '长沙', '慈溪', '重庆', '献县(沧州)', '长春', '金坛市(常州)', '滁州', '楚雄', '简阳市(成都)', '承德', '郴州', '天长市(滁州)', '长沙', '长乐', '赤峰',
                  '昌吉', '永兴县(郴州)', '沧州', '潮州', '常州', '池州', '常德'
                ]
              },
              {
                name: 'D',
                cityName: ['德阳', '大理', '寮步镇(东莞)', '定州', '大冶', '大兴安岭', '中江县(德阳)', '加格达奇(大兴安岭)', '大同', '东营', '东莞', '齐河县(德州)', '东兴', '利津县(东营)', '广饶县(东营)',
                  '大石桥', '儋州', '德州', '东台', '达州', '大庆', '庄河市(大连)', '东方', '大连', '丹东', '都江堰', '东阳'
                ]
              },
              {
                name: 'E',
                cityName: ['鄂尔多斯', '鄂州', '二连浩特', '恩施']
              },
              {
                name: 'F',
                cityName: ['闽侯县(福州)', '丰城', '福州', '长乐市(福州)', '福清', '富阳', '临泉县(阜阳)', '太和县(阜阳)', '奉化', '佛山', '阜阳', '颍上县(阜阳)', '抚顺', '防城港', '阜南县(阜阳)',
                  '东乡县(抚州)', '抚州', '阜新'
                ]
              },
              {
                name: 'G',
                cityName: ['共青城', '广安', '广元', '广汉', '南明区(贵阳)', '广水', '桂林', '贵阳', '赣州', '广州', '贵港',]
              },
              {
                name: 'H',
                cityName: ['海宁', '蕲春(黄冈)', '河池', '巨野县(菏泽)', '黄冈', '湖州', '怀化', '红安县(黄冈)', '黄石', '郓城县(菏泽)', '弥勒市(红河州)', '淮南', '淮北', '杭州', '东明县(菏泽)', '海城',
                  '肥西县(合肥)', '盱眙县(淮安)', '黑河', '涟水县(淮安)', '安平县(衡水)', '常宁市(衡阳)', '庐江县(合肥)', '浠水县(黄冈)', '阳新县(黄石)', '鹤岗', '邯郸', '河津', '呼伦贝尔', '衡东县(衡阳)',
                  '淮安', '菏泽', '单县(菏泽)', '合肥', '海口', '哈尔滨', '兴城市(葫芦岛)', '溆浦县(怀化)', '珲春', '汉中', '磁县(邯郸)', '老余杭区(杭州)', '呼和浩特', '葫芦岛', '惠东县(惠州)',
                  '惠州', '洪湖', '鹤壁', '河源', '河间', '衡水', '泸西县(红河州)', '红河州', '武穴市(黄冈)', '黄山', '贺州', '黄骅', '海拉尔(呼伦贝尔)', '尚志市(哈尔滨)', '衡阳',
                ]
              },
              {
                name: 'i',
                cityName: []
              },
              {
                name: 'J',
                cityName: ['荆门', '监利县(荆州)', '济南', '江阴', '晋城', '吉安', '海宁市(嘉兴)', '公安县(荆州)', '松滋市(荆州)', '乐平区(景德镇)', '景洪', '酒泉', '佳木斯', '恩平市(江门)', '揭阳',
                  '建德', '凌海市(锦州)', '嘉兴', '金乡县(济宁)', '曲阜市(济宁)', '吉林', '荆州', '锦州', '汶上县(济宁)', '济源', '胶州', '青阳镇(江阴)', '嘉峪关', '九江', '景德镇', '即墨',
                  '微山县(济宁)', '焦作', '晋中', '句容', '江山', '江油', '普宁(揭阳)', '武义县(金华)', '江门', '石首市(荆州)', '金昌', '嘉祥县(济宁)', '吉州区(吉安)', '瑞昌(九江)', '晋江',
                  '高平市(晋城)', '敦煌市(酒泉)', '靖江', '吉首', '金华', '济宁', '鸡西', '京山县(荆门)',
                ]
              },
              {
                name: 'K',
                cityName: ['莒南县(临沂)', '乐山', '浏阳(浏阳)', '临沧', '莱州', '洪洞县(临汾)', '霸州(廊坊)', '连云港', '娄底', '丽水', '兰溪', '六安', '灌南县(连云港)', '东海县(连云港)', '陵水',
                  '莱芜', '固安县(廊坊)', '漯河', '来宾', '兰州', '罗庄区(临沂)', '临汾', '利川', '沂水县(临沂)', '洛阳', '侯马市(临汾)', '三河燕郊(廊坊)', '浏阳', '峨眉山市(乐山)', '溧阳',
                  '丽江', '柳林县(吕梁)', '文安县(廊坊)', '冷水江市(娄底)', '泸州', '龙岩', '耒阳', '东阿县(聊城)', '临海', '聊城', '柳州', '舒城县(六安)', '临沂', '廊坊', '辽源', '吕梁',
                  '辽阳', '新化县(娄底)', '龙泉市(丽水)', '姜漪区(六安)', '临安',
                ]
              },
              {
                name: 'L',
                cityName: ['莒南县(临沂)', '乐山', '浏阳(浏阳)', '临沧', '莱州', '洪洞县(临汾)', '霸州(廊坊)', '连云港', '娄底', '丽水', '兰溪', '六安', '灌南县(连云港)', '东海县(连云港)', '陵水',
                  '莱芜', '固安县(廊坊)', '漯河', '来宾', '兰州', '罗庄区(临沂)', '临汾', '利川', '沂水县(临沂)', '洛阳', '侯马市(临汾)', '三河燕郊(廊坊)', '浏阳', '峨眉山市(乐山)', '溧阳',
                  '丽江', '柳林县(吕梁)', '文安县(廊坊)', '冷水江市(娄底)', '泸州', '龙岩', '耒阳', '东阿县(聊城)', '临海', '聊城', '柳州', '舒城县(六安)', '临沂', '廊坊', '辽源', '吕梁',
                  '辽阳', '新化县(娄底)', '龙泉市(丽水)', '姜漪区(六安)', '临安',
                ]
              },
              {
                name: 'M',
                cityName: ['当涂县(马鞍山)', '梅河口', '兴宁市(梅州)', '绵阳', '眉山', '芒市', '麻城', '梅州', '信宜市(茂名)', '蒙自', '牡丹江', '茂名', '马鞍山',]
              },
              {
                name: 'N',
                cityName: ['宁德', '南昌', '南充', '南京', '南通', '南平', '南宁', '进贤县(南昌)', '南阳', '海门市(南通)', '内江', '宁波', '如东县(南通)', '红谷滩(南昌)',]
              },
              {
                name: 'P',
                cityName: ['彭州', '萍乡', '攀枝花', '平凉', '平湖', '汝州市(平顶山)', '平顶山', '安源区(萍乡)', '盘锦', '莆田', '濮阳', '普洱',]
              },
              {
                name: 'Q',
                cityName: ['平度(青岛)', '琼海', '启东', '钦州', '北戴河(秦皇岛)', '昌黎县(秦皇岛)', '青岛', '惠安县(泉州)', '南安市(泉州)', '齐齐哈尔', '秦皇岛', '衢州', '钦北区(钦州)', '青州', '德化县(泉州)',
                  '晋江市(泉州)', '清远', '泉州', '七台河', '山海关区(秦皇岛)', '曲靖', '永春县(泉州)', '潜江', '庆阳',
                ]
              },
              {
                name: 'R',
                cityName: ['日照', '五莲县(日照)', '荣成', '石岛(荣成)', '瑞安', '任丘', '如皋',]
              },
              {
                name: 'S',
                cityName: ['上虞', '石家庄', '汕头', '双鸭山', '商洛', '苏州', '邵阳', '绍兴', '上海', '邵阳', '晋州市(石家庄)', '埇桥区(宿州)', '石河子', '三明', '三门峡', '寿光', '洞口县(邵阳)',
                  '汕尾', '玉山县(上饶)', '上饶', '遂宁', '泗洪县(宿迁)', '朔州', '万年县(上饶)', '随州', '龙华新区(深圳)', '三亚', '绥化', '韶关', '泗阳县(宿迁)', '新乐市(石家庄)', '邵东县(邵阳)',
                  '宿迁', '深圳', '松原', '怀仁县(朔州)', '沈阳', '商丘', '宿州', '沭阳县(宿迁)', '石狮', '石嘴山', '平山县(石家庄)', '永城市(商丘)'
                ]
              },
              {
                name: 'T',
                cityName: ['台山', '通化', '铜川', '天水', '新泰市(泰安)', '泰州', '泰兴(泰州)', '铜陵', '铁岭', '迁安市(唐山)', '昌图县(铁岭)', '天台', '天津', '台州', '肥城市(泰安)', '滦南县(唐山)',
                  '三河(天津)', '桐乡', '太仓', '太原', '唐山', '天门', '通辽', '泰安', '滨海新区(天津)'
                ]
              },
              {
                name: 'W',
                cityName: ['乳山市(威海)', '武威', '温岭', '文登(威海)', '昌邑市(潍坊)', '文昌', '渭南', '乌鲁木齐', '无为县(芜湖)', '无锡', '武安', '乌兰浩特', '梧州', '乌兰察布', '吴江', '高密市(潍坊)',
                  '文山', '威海', '乌海', '诸城市(潍坊)', '荣成市(威海)', '万宁', '潍坊', '泰顺县(温州)', '芜湖', '温州', '蒲城县(渭南)', '韩城市(渭南)', '永嘉县(温州)', '武汉', '南陵县(芜湖)',
                  '澄城县(渭南)',
                ]
              },
              {
                name: 'X',
                cityName: ['汉川(孝感)', '云梦县(孝感)', '大悟县(孝感)', '孝昌县(孝感)', '宁晋县(邢台)', '仙桃', '谷城县(襄阳)', '襄阳', '广德县(宣城)', '固始县(信阳)', '新余', '新乡', '厦门', '丰县(徐州)',
                  '湘潭', '沙河市(邢台)', '孝义', '孝感', '西昌', '兴平', '锡林郭勒', '兴化', '原平市(忻州)', '渝水区(新余)', '许昌', '信阳', '邢台', '潢川县(信阳)', '光山县(信阳)', '湘潭',
                  '禹州市(许昌)', '睢宁县(徐州)', '徐州', '沛县(徐州)', '西宁', '锡林浩特市(锡林郭勒)', '湘乡', '宣城', '分宜县(新余)', '咸宁', '长垣县(新乡)', '萧山', '新沂市(徐州)', '辉县市(新乡)',
                  '忻州', '宁国市(宣城)', '咸阳', '襄樊(襄阳)', '宜城市(襄阳)', '西安',
                ]
              },
              {
                name: 'Y',
                cityName: ['银川', '仪征市(扬州)', '榆林', '宜都', '延吉', '伊宁市(伊犁)', '宜兴', '建湖县(盐城)', '宜春', '蓬莱市(烟台)', '烟台', '宜宾', '高邮市(扬州)', '高安市(宜春)', '宝应县(扬州)',
                  '永济市(运城)', '乐清', '伊春', '运城', '永安', '永康', '余姚', '玉环', '益阳', '阳江', '鹰潭', '海阳市(烟台)', '玉溪', '扬州', '岳阳', '延安', '盐城', '绥德县(榆林)',
                  '龙口市(烟台)', '永州', '玉林', '扬中', '益阳', '应城', '云浮', '宜昌', '伊犁', '莱阳市(烟台)', '沅江', '营口', '华容县(岳阳)', '阳泉', '赫山区(益阳)', '岳阳', '枝江(宜昌)',
                  '阜宁县(盐城)', '滨海县(盐城)', '义乌', '响水县(盐城)', '临湘市(岳阳)',
                ]
              },
              {
                name: 'Z',
                cityName: ['张家口', '诸暨', '张家港', '漳浦县(漳州)', '平舆县(驻马店)', '龙海市(漳州)', '湛江', '珠海', '镇江', '滕州市(枣庄)', '醴陵市(株洲)', '仁怀市(遵义)', '舟山', '岱山县(舟山)',
                  '郑州', '中牟县(郑州)', '株洲', '新郑市(郑州)', '中山', '淄博', '金港镇(张家港)', '肇庆', '自贡', '遵化', '涿州', '永定区(张家界)', '株洲', '驻马店', '招远', '枣庄', '张家界',
                  '昭通', '周口', '遵义', '章丘', '漳州', '樟树', '枣阳', '张掖', '资阳', '邹城',
                ]
              }
            ]
          }
      },
      methods:{
      ...mapMutations([
        'selectCity'
      ]),
        selectItem (city) {
          this.selectCity(city)
          this.$emit('getCity',city)
        }
      }
    }
</script>

<style scoped>
.list-page{
  background-color: #f3f4f5;
  padding: 50px 20px 0 20px;
  position: fixed;
  top: 2px;
  z-index: 10000;
  box-sizing: border-box;
  left: 0;
  right: 0;
  width: 100%;
  margin: 0 auto;

}
.list-content{
  width: 100%;
  height: 95%;
  margin: 0 auto;
  background: #fff;
}
</style>
